XMegaForArduino/arduino/variants/cc0_atxmega_e5/pins_arduino.h
#define DEFAULT_TWI TWIC

// serial port 0
#define SERIAL_0_PORT_NAME PORTD
#define SERIAL_0_USART_NAME USARTD0
#define SERIAL_0_USART_DATA USARTD0_DATA
#define SERIAL_0_RXC_ISR ISR(USARTD0_RXC_vect)
#define SERIAL_0_DRE_ISR ISR(USARTD0_DRE_vect)
#define SERIAL_0_REMAP PORTD_REMAP         /* define THIS to re-map the pins from 0-3 to 4-7 on serial port 0 */
#define SERIAL_0_REMAP_BIT PORT_USART0_bm  /* the bitmask needed to remap the port if SERIAL_0_REMAP is defined */
#define SERIAL_0_RX_PIN_INDEX 6 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_0_TX_PIN_INDEX 7 /* the pin number on the port, not the mapped digital pin number */

// serial port 1
#define SERIAL_1_PORT_NAME PORTC
#define SERIAL_1_USART_NAME USARTC0
#define SERIAL_1_USART_DATA USARTC0_DATA
#define SERIAL_1_RXC_ISR ISR(USARTC0_RXC_vect)
#define SERIAL_1_DRE_ISR ISR(USARTC0_DRE_vect)
//#define SERIAL_1_REMAP PORTC_REMAP        /* define THIS to re-map the pins from 0-3 to 4-7 on serial port 1 */
//#define SERIAL_1_REMAP_BIT PORT_USART0_bm /* the bit needed to remap the port if SERIAL_1_REMAP is defined */
#define SERIAL_1_RX_PIN_INDEX 2 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_1_TX_PIN_INDEX 3 /* the pin number on the port, not the mapped digital pin number */


#ifdef DIGITAL_IO_PIN_SHIFT
#define TCD5_PIN_SHIFT 0x0 /* 0000b PD0 PD1 PD2 PD3 */
#else // DIGITAL_IO_PIN_SHIFT
#define TCD5_PIN_SHIFT 0xc /* 1100b PD0 PD1 PD6 PD7 */
#endif // DIGITAL_IO_PIN_SHIFT


// TWI is on TWIC (port C pins 0/1)

// This layout describes the 'cc0 atxmega32e5 breakout board'
// https://www.tindie.com/products/andete/atxmega32e5-breakout-board/
// 
//     
//     
//                     V G             R T V G
//     A A A A A A A A C N             X X C N
//     0 1 2 3 4 5 6 7 C D             D D C D
//   --o-o-o-o-o-o-o-o-o-o-o-o-o-o-o-o-o-o-o-o-
//     P P P P P P P P     P P P P P P P P
//     A A A A A A A A     D D D D D D D D
//     0 1 2 3 4 5 6 7     0 1 2 3 4 5 6 7
//                                           o - GND
//               T O P   V I E W             o - CTS
//                                           o - VCC
//         P P P P P P P P  G P P R P V      o - TXO (PD7)
//         C C C C C C C C  N R R S D C      o - RXI (PD6)
//         7 6 5 4 3 2 1 0  D 1 0 T I C      o - DTR
//   --o-o-o-o-o-o-o-o-o-o--o-o-o-o-o-o--------
//     G V S M M S T R S S
//     N C C I O S X X C D
//     D C K S S   C C L A
//           O I
//
// with shifted pin assignments, digital 0 through 17 are as follows:
// PD6, PD7, PD4, PD5, PD2, PD3, PD0, PD1, PC2, PC3, PC4, PC5, PC6, PC7, PR0, PR1, PC0, PC1
//
// As with the MEGA2560 and other 'mega' Arduino boards, additional connectors would
// break out the additional pins, with appropriate labeling.  Additionally, there should
// be an LED on PORTR pin 1 for 'LED_BUILTIN'.
//
// This layout is based on the 'Rev C' Arduino.
//
// NOTE - NO AREF:  AREF is not connected.  AREF is a bit of an issue on xmega because
// it DOES! NOT! WORK! THE! SAME! as it does on the ATmegaXXX and so you would need to
// (literally) steal one of the additional analog input pins to implement it. It's not
// impossible, or even THAT difficult.  I'm just not doing it here.
//



#ifdef DIGITAL_IO_PIN_SHIFT /* aka digital I/O pin 0 is PORTD pin 2, and PORTD 0-1 and PORTC 0-1 are re-mapped for Arduino shield compatibility */

// SHIFTED I/O pins (atmega compatibility) - see xmega mod description in comment at top

// default SPI
static const uint8_t SS   = 10;
static const uint8_t MOSI = 11;
static const uint8_t MISO = 12;
static const uint8_t SCK  = 13;

// primary SPI on PC4-7
static const uint8_t SS0   = 10;
static const uint8_t MOSI0 = 11;
static const uint8_t MISO0 = 12;
static const uint8_t SCK0  = 13;

// secondary SPI on PD4-7
static const uint8_t SS1   = 2;
static const uint8_t MOSI1 = 3;
static const uint8_t MISO1 = 4;
static const uint8_t SCK1  = 5;

// default 2-wire on PC0,PC1 - TWIC
static const uint8_t SDA = 16;
static const uint8_t SCL = 17;

// keep track of the indices for port R since its control register
// settings should be slightly different - D manual table 11-6 etc.
#define PR0 14
#define PR1 15

#else // no digital I/O pin shifting, PORTD pin 0 is digital I/O pin 0 (as it should be)

// default "no shift" pin assignments

// default SPI
static const uint8_t SS   = 12;
static const uint8_t MOSI = 13;
static const uint8_t MISO = 14;
static const uint8_t SCK  = 15;

// primary SPI on PC4-7
static const uint8_t SS0   = 12;
static const uint8_t MOSI0 = 13;
static const uint8_t MISO0 = 14;
static const uint8_t SCK0  = 15;

// secondary SPI on PD4-7
static const uint8_t SS1   = 4;
static const uint8_t MOSI1 = 5;
static const uint8_t MISO1 = 6;
static const uint8_t SCK1  = 7;

// default 2-wire on PC0,PC1 - TWIC
static const uint8_t SDA = 8;
static const uint8_t SCL = 9;

// keep track of the indices for port R since its control register
// settings should be slightly different - D manual table 11-6 etc.
#define PR0 16
#define PR1 17

#endif // DIGITAL_IO_PIN_SHIFT


// default 'status' LED on PR1
//static const uint8_t LED_BUILTIN = PR1;
#define LED_BUILTIN PR1 /* Arduino 1.06 uses #define, not a const uint8_t */

static const uint8_t A0 = 18;
static const uint8_t A1 = 19;
static const uint8_t A2 = 20;
static const uint8_t A3 = 21;
static const uint8_t A4 = 22;
static const uint8_t A5 = 23;
static const uint8_t A6 = 24;
static const uint8_t A7 = 25;

// on the xmega 'E' series, PA2, PC2, and PD2 are asynchronous ints.  Others are 'synchronous' which means
// that they must be held in their 'interrupt state' long enough for the system to detect them.  In any case
// all digital input pins can be use as interrupts, synchronous or otherwise.


#ifdef ARDUINO_MAIN

// TODO:  modify 'core' code to have different indices for E series?  For now it's ok as-is

const uint16_t PROGMEM port_to_mode_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_DIR,       // PA
  NOT_A_PORT,                  // 2  [E series has no 'port B'
  (uint16_t) &PORTC_DIR,       // PC
  (uint16_t) &PORTD_DIR,       // PD
  NOT_A_PORT,                  // 5  [E series has no 'port E'
  (uint16_t) &PORTR_DIR,       // PR
};

const uint16_t PROGMEM port_to_output_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_OUT,       // PA
  NOT_A_PORT,                  // 2  [E series has no 'port B'
  (uint16_t) &PORTC_OUT,       // PC
  (uint16_t) &PORTD_OUT,       // PD
  NOT_A_PORT,                  // 5  [E series has no 'port E'
  (uint16_t) &PORTR_OUT,       // PR
};

const uint16_t PROGMEM port_to_input_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_IN,        // PA
  NOT_A_PORT,                  // 2  [E series has no 'port B'
  (uint16_t) &PORTC_IN,        // PC
  (uint16_t) &PORTD_IN,        // PD
  NOT_A_PORT,                  // 5  [E series has no 'port E'
  (uint16_t) &PORTR_IN,        // PR
};

// xmega has a per-pin config register as well.  Normally these will be 00000111 for analog, 00000000 for digital 'totem pole'
// for 'INPUT_PULLUP' these will be 00011111
//   bits 2:0 (trigger)  000 both edges  001 rising  010 falling  011 level  111 input buffer disabled
//            note:  'input buffer disabled' required to use the 'IN' register (so default here)
//                   also port R does not support 'INTPUT_DISABLED' (sic) so use BOTHEDGES [0] instead
//   bits 5:3 (out/pull) 000 TOTEM [normal], 001 bus keeper [sticky], 010 pulldown, 011 pullup,
//                       100 wired 'or', 101 wired 'and', 110 wired 'or' pulldown, 111 wired 'and' pullup
//   bit 6:  "invert logic" (0 = normal, 1 = inverted)
//   bit 7:  unused, must be zero
// NOTE:  PORTA through PORTE (PORTF?) support 'input buffer disabled' and this setting is recommended
//        for analog inputs.  PORTR apparently does NOT support this (set to zero?)

