XMegaForArduino/arduino/variants/cc0_atxmega_e5/pins_arduino.h
#ifndef DIGITAL_IO_PIN_SHIFT
  TIMERD5,       // PD 0 ** 0 **
  TIMERD5,       // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT

// subtract 2 from the digital pin number if DIGITAL_IO_PIN_SHIFT is defined
  NOT_ON_TIMER,  // PD 2,6 ** 2 ** USARTD_RX
  NOT_ON_TIMER,  // PD 3,7 ** 3 ** USARTD_TX
  NOT_ON_TIMER,  // PD 4   ** 4 **
  NOT_ON_TIMER,  // PD 5   ** 5 **
  TIMERD5,       // PD 6,2 ** 6 **
  TIMERD5,       // PD 7,3 ** 7 **

#ifdef DIGITAL_IO_PIN_SHIFT
  TIMERD5,       // PD 0 ** 8 **
  TIMERD5,       // PD 1 ** 9 **
#else // no pin shifting
  TIMERC4,       // PC 0 ** 8 ** SDA
  TIMERC4,       // PC 1 ** 9 ** SCL
#endif // DIGITAL_IO_PIN_SHIFT
  TIMERC4,       // PC 2 ** 10 **
  TIMERC4,       // PC 3 ** 11 **
  TIMERC4,       // PC 4 ** 12 ** SPI_SS
  TIMERC4,       // PC 5 ** 13 ** SPI_MOSI
  TIMERC4,       // PC 6 ** 14 ** SPI_MISO
  TIMERC4,       // PC 7 ** 15 ** SPI_SCK
  NOT_ON_TIMER,  // PR 0 ** 16 **
  NOT_ON_TIMER,  // PR 1 ** 17 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
  TIMERC4,       // PC 0 ** the new 16 **
  TIMERC4,       // PC 1 ** the new 17 **
#endif // DIGITAL_IO_PIN_SHIFT
  NOT_ON_TIMER,  // PA 0 ** 22 ** A0
  NOT_ON_TIMER,  // PA 1 ** 23 ** A1
  NOT_ON_TIMER,  // PA 2 ** 24 ** A2
  NOT_ON_TIMER,  // PA 3 ** 25 ** A3
  NOT_ON_TIMER,  // PA 4 ** 26 ** A4
  NOT_ON_TIMER,  // PA 5 ** 27 ** A5
  NOT_ON_TIMER,  // PA 6 ** 28 ** A6
  NOT_ON_TIMER,  // PA 7 ** 29 ** A7
};

#endif


// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR   Serial
#define SERIAL_PORT_HARDWARE  Serial
#define SERIAL_HARDWARE_OPEN  Serial2

#endif


